#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ЗначениеАбонентскаяПлата = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Если Объект.ВидДоговора = ЗначениеАбонентскаяПлата Тогда
		Элементы["ВКМ_ГруппаАбонентскаяПлата"].Видимость = Истина;
	Иначе 
		Элементы["ВКМ_ГруппаАбонентскаяПлата"].Видимость = Ложь;			
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьРеквизитов()
	
	ГруппаАбонентскаяПлата = Элементы.Добавить("ВКМ_ГруппаАбонентскаяПлата", Тип("ГруппаФормы"));
	ГруппаАбонентскаяПлата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскаяПлата.ОтображатьЗаголовок = Ложь; 
	ГруппаАбонентскаяПлата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаАбонентскаяПлата.РастягиватьПоГоризонтали = Истина;
	ГруппаАбонентскаяПлата.Видимость = Ложь;
	
	ГруппаПериодДействияДоговора = Элементы.Добавить("ВКМ_ГруппаПериодДействияДоговора", Тип("ГруппаФормы"), ГруппаАбонентскаяПлата);	
	ГруппаПериодДействияДоговора.Заголовок = "Период действия договора";
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.ОтображатьЗаголовок = Ложь; 
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериодДействияДоговора.РастягиватьПоГоризонтали = Истина;
	
	НачалоДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ГруппаПериодДействияДоговора);
	НачалоДействияДоговора.Заголовок = "Начало действия договора";
	НачалоДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	НачалоДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	
	КонецДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ГруппаПериодДействияДоговора);
	КонецДействияДоговора.Заголовок = "Конец действия договора";
	КонецДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	КонецДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскаяПлата);
	СуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонентскаяПлата);
	СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры

#КонецОбласти





