&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	#Область ДобавлениеРеквизитовФормы
	
	//Опишем Типы реквизитов
	ТипРеквзититаДата = Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипРеквзититаСтоимость = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2));
	
    // Массив для новых реквизитов
    ДобавляемыеРеквизиты = Новый Массив;
		
    // Опишем ревизиты формы
	РеквизитДатаНачала = Новый РеквизитФормы("ДатаНачала", ТипРеквзититаДата,, "Дата начала договора"); 
	РеквизитДатаОкончания = Новый РеквизитФормы("ДатаОкончания", ТипРеквзититаДата,, "Дата окончания договора");
	РеквизитСуммаАбонентскойПлаты = Новый РеквизитФормы("СуммаАбонентскойПлаты", ТипРеквзититаСтоимость,, "Сумма абонентской платы");
	РеквизитСтоимостьЧасаРаботы = Новый РеквизитФормы("СтоимостьЧасаРаботы", ТипРеквзититаСтоимость,, "Стоимость часа работы специалиста");
	
    // Заполняем массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(РеквизитДатаНачала); 
	ДобавляемыеРеквизиты.Добавить(РеквизитДатаОкончания);
	ДобавляемыеРеквизиты.Добавить(РеквизитСуммаАбонентскойПлаты);
	ДобавляемыеРеквизиты.Добавить(РеквизитСтоимостьЧасаРаботы);
	
    // Добавим новые реквизиты на форму
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
    #КонецОбласти
	
	#Область ДобавлениеЭлементовФормы

	// Элементы
    ЭлементДатаНачала = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"));
	ЭлементДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаНачала.ПутьКДанным  = "Объект.ВКМ_ДатаНачала";
	ЭлементДатаНачала.Видимость = Ложь;
	
	ЭлементДатаОкончания = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"));
	ЭлементДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементДатаОкончания.ПутьКДанным  = "Объект.ВКМ_ДатаОкончания";
	ЭлементДатаОкончания.Видимость = Ложь;
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным  = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементСуммаАбонентскойПлаты.Видимость = Ложь;
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным  = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
	ЭлементСтоимостьЧасаРаботы.Видимость = Ложь;

	//Корректировка: исключаем использование "ПриОткрытии"
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	
	#КонецОбласти

КонецПроцедуры   

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	ВидимостьРеквизитов();
//	
//КонецПроцедуры

&НаКлиенте
Процедура ВидимостьРеквизитов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ДатаНачала.Видимость = Истина; 
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина; 
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ДатаНачала.Видимость = Ложь; 
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь; 
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли
	
КонецПроцедуры




