#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ГрафикиОтпусков
	Движения.ВКМ_ГрафикиОтпусков.Записывать = Истина;
	Для Каждого ТекСтрока из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикиОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.ДатаНачала = ТекСтрока.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрока.ДатаОкончания;
		ДнейОтпуска = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала) /86400 + 1;
		Движение.ДнейОтпуска = ДнейОтпуска;
	КонецЦикла; 
 
КонецПроцедуры

#КонецОбласти

