
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РасчитатьДниОтпуска();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РасчитатьДниОтпуска();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	РасчитатьДниОтпуска();		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Год) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать год");
		Возврат;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьДниОтпуска()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.ДнейОтпуска = (КонецДня(Строка.ДатаОкончания) + 1 - НачалоДня(Строка.ДатаНачала)) / 86400
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( ,
	"Сотрудник,ДатаНачала,ДатаОкончания"), УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции

#КонецОбласти





